In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [43]:
df = pd.read_csv('homeprices2.csv')
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

# cleaning data

removing NaN value with median

In [44]:
nan_value = df.bedrooms.median()

In [45]:
bedrooms = df.bedrooms.fillna(nan_value)
bedrooms

0    3.0
1    4.0
2    4.0
3    3.0
4    5.0
5    6.0
Name: bedrooms, dtype: float64

In [46]:
df = df.drop(columns=['bedrooms'])

In [47]:
df['bedrooms'] = bedrooms

In [48]:

df

   area  age   price  bedrooms
0  2600   20  550000       3.0
1  3000   15  565000       4.0
2  3200   18  610000       4.0
3  3600   30  595000       3.0
4  4000    8  760000       5.0
5  4100    8  810000       6.0

In [28]:
reg = linear_model.LinearRegression()

In [53]:
a = df.drop(columns=['price'])
a

   area  age  bedrooms
0  2600   20       3.0
1  3000   15       4.0
2  3200   18       4.0
3  3600   30       3.0
4  4000    8       5.0
5  4100    8       6.0

In [54]:
reg.fit(df.drop(columns=['price']),df.price)

LinearRegression()

In [55]:
reg.coef_

array([  112.06244194, -3231.71790863, 23388.88007794])

In [56]:
reg.intercept_

221323.00186540413

# Find price of home with 5000 sqr ft area, 6 bedrooms, 20 year old

In [66]:
reg.predict([[5000, 20, 6]])

array([857334.13387105])

In [67]:
112.06244194*5000 + -3231.71790863*20 + 23388.88007794*6 + 221323.00186540413

857334.1338604442